#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_domain.domain will be created
  + resource "linode_domain" "domain" {
      + id        = (known after apply)
      + soa_email = "linode@dangerous.tech"
      + status    = (known after apply)
      + tags      = [
          + "fealty",
        ]
      + type      = "master"
    }

  # linode_domain_record.rewards will be created
  + resource "linode_domain_record" "rewards" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "rewards"
      + record_type = "A"
      + target      = (known after apply)
      + ttl_sec     = 30
    }

  # linode_instance.app will be created
  + resource "linode_instance" "app" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty_app"
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + purpose = "public"
        }
      + interface {
          + ipam_address = "10.10.10.2/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_instance.db will be created
  + resource "linode_instance" "db" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty_db"
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + ipam_address = "10.10.10.3/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*